<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Microsoft FIDO Authentication</displayName>
  <description>Configuration for Microsoft FIDO Authentication</description>
  <resources>
    <stringTable>
        <string id="MSFidoAuthenticationCategory">Microsoft FIDO Authentication</string>
        <string id="MSFidoAuthentication_AllowDeviceLogon">Enable usage of FIDO devices to sign on</string>
        <string id="MSFidoAuthentication_AllowDeviceLogonExplain">This policy allows users to use a FIDO device, such as a phone, NFC card, to sign on to a desktop computer running Windows 10.

If you enable this policy setting, users can sign on to Windows using a FIDO device.

If you disable or do not configure this policy, users cannot use a FIDO device to sign on.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
