<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Local Security Authority Settings</displayName>
  <description>Settings for the Local Security Authority</description>
  <resources>
    <stringTable>
        <string id="LocalSecurityAuthority">Local Security Authority</string>

        <string id="AllowCustomSSPsAPs">Allow Custom SSPs and APs to be loaded into LSASS</string>
        <string id="AllowCustomSSPsAPs_Help">This policy controls the configuration under which LSASS loads custom SSPs and APs.

If you enable this setting or do not configure it, LSA allows custom SSPs and APs to be loaded.

If you disable this setting, LSA does not load custom SSPs and APs.</string>

        <string id="ConfigureLsaProtectedProcess">Configures LSASS to run as a protected process</string>
        <string id="ConfigureLsaProtectedProcess_Help">This policy controls the configuration under which LSASS is run.

If you do not configure this policy and there is no current setting in the registry, LSA will run as protected process for all clean installed, HVCI capable, client SKUs. This configuration is not UEFI locked. This can be overridden if the policy is configured.

If you configure and set this policy setting to "Disabled", LSA will not run as a protected process.

If you configure and set this policy setting to "EnabledWithUEFILock," LSA will run as a protected process and this configuration is UEFI locked.

If you configure and set this policy setting to "EnabledWithoutUEFILock", LSA will run as a protected process and this configuration is not UEFI locked. </string>

      <string id="ConfigureLsaProtectedProcess_Disabled">Disabled</string>
      <string id="ConfigureLsaProtectedProcess_EnabledWithUEFILock">Enabled with UEFI Lock</string>
      <string id="ConfigureLsaProtectedProcess_EnabledWithoutUEFILock">Enabled without UEFI Lock</string>

    </stringTable>
    <presentationTable>
        <presentation id="ConfigureLsaProtectedProcess">
        <dropdownList refId="ConfigureLsaProtectedProcess" noSort="true">Configure LSA to run as a protected process</dropdownList>
    </presentation>
   </presentationTable>
  </resources>
</policyDefinitionResources>
