<?xml version="1.0" encoding="utf-8"?>
<!--  Copyright (C) Microsoft Corporation. All rights reserved  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="newsandinterests" namespace="Microsoft.Policies.NewsAndInterests" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="NewsAndInterests" displayName="$(string.NewsAndInterests)">
      <parentCategory ref="windows:WindowsComponents" />
    </category>
  </categories>
  <policies>
    <policy name="AllowNewsAndInterests" class="Machine" displayName="$(string.AllowNewsAndInterests)" explainText="$(string.Explain_AllowNewsAndInterests)" key="SOFTWARE\Policies\Microsoft\Dsh" valueName="AllowNewsAndInterests">
      <parentCategory ref="NewsAndInterests" />
      <supportedOn ref="windows:SUPPORTED_Windows_10_0_NOSERVER" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
    <policy name="DisableWidgetsOnLockScreen" class="Machine" displayName="$(string.DisableWidgetsOnLockScreen)" explainText="$(string.Explain_DisableWidgetsOnLockScreen)" key="SOFTWARE\Policies\Microsoft\Dsh" valueName="DisableWidgetsOnLockScreen">
      <parentCategory ref="NewsAndInterests" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2_NOSERVER" />
      <enabledValue>
        <decimal value="0" />
      </enabledValue>
      <disabledValue>
        <decimal value="1" />
      </disabledValue>
    </policy>
    <policy name="DisableWidgetsBoard" class="Machine" displayName="$(string.DisableWidgetsBoard)" explainText="$(string.Explain_DisableWidgetsBoard)" key="SOFTWARE\Policies\Microsoft\Dsh" valueName="DisableWidgetsBoard">
      <parentCategory ref="NewsAndInterests" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2_NOSERVER" />
      <enabledValue>
        <decimal value="0" />
      </enabledValue>
      <disabledValue>
        <decimal value="1" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
